In [2]:
import pandas as pd

data = {
    'Name': ['Rana', 'Alluarjun', 'MSDhoni'],
    'Age': [25,40, 45],
    'City': ['India', 'Telangana', 'Chennai']
}
df = pd.DataFrame(data)

df

        Name  Age       City
0       Rana   25      India
1  Alluarjun   40  Telangana
2    MSDhoni   45    Chennai

In [3]:
df.head()

        Name  Age       City
0       Rana   25      India
1  Alluarjun   40  Telangana
2    MSDhoni   45    Chennai

In [4]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
df['Name']

0         Rana
1    Alluarjun
2      MSDhoni
Name: Name, dtype: object

In [6]:
df.iloc[0]

Name     Rana
Age        25
City    India
Name: 0, dtype: object

In [7]:
data_dict = [
    {'Name': 'Rana', 'Age': 25, 'City': 'India'},
    {'Name': 'Alluarjun', 'Age': 40, 'City': 'Telangana'},
    {'Name': 'MSDhoni', 'Age': 45, 'City': 'Chennai'}
]
df_dict = pd.DataFrame(data_dict)

df_dict

        Name  Age       City
0       Rana   25      India
1  Alluarjun   40  Telangana
2    MSDhoni   45    Chennai

In [8]:
df.to_csv('data.csv', index=False)

1.An indispensable procedure for those who design interactive data visualizations is the "write/render/evaluate" cycle. Write code or commands, display the output to see the impacts right away, and then analyze the results to evaluate if the visualization successfully conveys the intended message. This process enables creators to iteratively design and modify visualizations. 

2.Because they engage consumers by letting them interact more directly with the data, dynamic, interactive data visualizations are essential for effective data communication. Users may filter, scale, and alter the data through interaction, exposing trends, patterns, and outliers that static visualizations would overlook. This dynamic method improves user comprehension and increases the accessibility and significance of the data.

3.I believe that the best option for presenting data visualizations is frequently to use open-source tools rather than proprietary software. Murray makes this point. Open-source technologies give users more freedom, transparency, and accessibility so they can freely share and alter their visualizations. Furthermore, these technologies are more inventive and sustainable than proprietary alternatives because of the cooperative character of open-source communities, which guarantees that they are constantly enhanced and supported.